src/Reports/БюджетДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>БюджетДДС</Name>
			<Comment>Бюджет движения денежных средств</Comment>
		</Properties>
	</Report>
</MetaDataObject>

src/Enums/ПериодичностьПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПериодичностьПланирования</Name>
			<Comment>Периодичность планирования</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
					<Comment>Месяц</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
					<Comment>Квартал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
					<Comment>Год</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Reports/БюджетДДС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыПлатформаСервер.ВывестиОтчет(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриИзмененииПараметра(ФормаОтчета, ДанныеСтроки)
	
	ИмяПараметра = СокрЛП(ДанныеСтроки.Параметр);
	
	Если НЕ ИмяПараметра = "СценарийПланирования" Тогда
		Возврат;
	КонецЕсли;
	
	СценарийПланирования = ДанныеСтроки.Значение;
	Если СценарийПланирования.Периодичность = Перечисления.ПериодичностьПланирования.Месяц Тогда
		
		ФормаОтчета.ВидПериода = "Месяц";
		ОтчетыПлатформаКлиентСервер.ОбновитьВариантыПериодов(ФормаОтчета);
		ОтчетыПлатформаКлиентСервер.УстановитьПометкуНаПериод(ФормаОтчета, "ПериодМесяц");
		ОтчетыПлатформаСервер.ВидимостьПериода(ФормаОтчета);
		
	ИначеЕсли СценарийПланирования.Периодичность=Перечисления.ПериодичностьПланирования.Квартал Тогда
	
		ФормаОтчета.ВидПериода = "Квартал";
		ОтчетыПлатформаКлиентСервер.ОбновитьВариантыПериодов(ФормаОтчета);
		ОтчетыПлатформаКлиентСервер.УстановитьПометкуНаПериод(ФормаОтчета, "ПериодКвартал");
		ОтчетыПлатформаСервер.ВидимостьПериода(ФормаОтчета);
	
	ИначеЕсли СценарийПланирования.Периодичность=Перечисления.ПериодичностьПланирования.Год Тогда
	
		ФормаОтчета.ВидПериода = "Год";
		ОтчетыПлатформаКлиентСервер.ОбновитьВариантыПериодов(ФормаОтчета);
		ОтчетыПлатформаКлиентСервер.УстановитьПометкуНаПериод(ФормаОтчета, "ПериодГод");
		ОтчетыПлатформаСервер.ВидимостьПериода(ФормаОтчета);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриИзмененииНастроек(ФормаОтчета) Экспорт
	
	Параметр = Новый ПараметрКомпоновкиДанных("СценарийПланирования");
	НайденныеПараметры = ФормаОтчета.ПараметрыДанных.НайтиСтроки(Новый Структура("Параметр", Параметр));
	Если НайденныеПараметры.Количество()>0 Тогда
	
		ДанныеСтроки = НайденныеПараметры[0];
		
		ПриИзмененииПараметра(ФормаОтчета, ДанныеСтроки);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ТекСценарийПланирования = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СценарийПланирования")).Значение;
	Если НЕ ЗначениеЗаполнено(ТекСценарийПланирования) Тогда
		ВывестиСообщение(НСтр("ru = 'Не установлено значение параметра ""Сценарий планирования"".'"),,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
